MikroElektronika/core_packages/PIC/XC8/def/PIC16F19185/mcu.h
// Register: LCDDATA20
#define LCDDATA20 LCDDATA20
extern volatile unsigned char           LCDDATA20           __at(0x1D2C);
#ifndef _LIB_BUILD
asm("LCDDATA20 equ 01D2Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned S18C3                  :1;
        unsigned S19C3                  :1;
        unsigned S20C3                  :1;
        unsigned                        :1;
        unsigned S22C3                  :1;
        unsigned S23C3                  :1;
    };
} LCDDATA20bits_t;
extern volatile LCDDATA20bits_t LCDDATA20bits __at(0x1D2C);
// bitfield macros
#define _LCDDATA20_S18C3_POSN                               0x2
#define _LCDDATA20_S18C3_POSITION                           0x2
#define _LCDDATA20_S18C3_SIZE                               0x1
#define _LCDDATA20_S18C3_LENGTH                             0x1
#define _LCDDATA20_S18C3_MASK                               0x4
#define _LCDDATA20_S19C3_POSN                               0x3
#define _LCDDATA20_S19C3_POSITION                           0x3
#define _LCDDATA20_S19C3_SIZE                               0x1
#define _LCDDATA20_S19C3_LENGTH                             0x1
#define _LCDDATA20_S19C3_MASK                               0x8
#define _LCDDATA20_S20C3_POSN                               0x4
#define _LCDDATA20_S20C3_POSITION                           0x4
#define _LCDDATA20_S20C3_SIZE                               0x1
#define _LCDDATA20_S20C3_LENGTH                             0x1
#define _LCDDATA20_S20C3_MASK                               0x10
#define _LCDDATA20_S22C3_POSN                               0x6
#define _LCDDATA20_S22C3_POSITION                           0x6
#define _LCDDATA20_S22C3_SIZE                               0x1
#define _LCDDATA20_S22C3_LENGTH                             0x1
#define _LCDDATA20_S22C3_MASK                               0x40
#define _LCDDATA20_S23C3_POSN                               0x7
#define _LCDDATA20_S23C3_POSITION                           0x7
#define _LCDDATA20_S23C3_SIZE                               0x1
#define _LCDDATA20_S23C3_LENGTH                             0x1
#define _LCDDATA20_S23C3_MASK                               0x80

// Register: LCDDATA21
#define LCDDATA21 LCDDATA21
extern volatile unsigned char           LCDDATA21           __at(0x1D2D);
#ifndef _LIB_BUILD
asm("LCDDATA21 equ 01D2Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S24C3                  :1;
        unsigned S25C3                  :1;
        unsigned S26C3                  :1;
        unsigned S27C3                  :1;
        unsigned S28C3                  :1;
        unsigned S29C3                  :1;
        unsigned S30C3                  :1;
        unsigned S31C3                  :1;
    };
} LCDDATA21bits_t;
extern volatile LCDDATA21bits_t LCDDATA21bits __at(0x1D2D);
// bitfield macros
#define _LCDDATA21_S24C3_POSN                               0x0
#define _LCDDATA21_S24C3_POSITION                           0x0
#define _LCDDATA21_S24C3_SIZE                               0x1
#define _LCDDATA21_S24C3_LENGTH                             0x1
#define _LCDDATA21_S24C3_MASK                               0x1
#define _LCDDATA21_S25C3_POSN                               0x1
#define _LCDDATA21_S25C3_POSITION                           0x1
#define _LCDDATA21_S25C3_SIZE                               0x1
#define _LCDDATA21_S25C3_LENGTH                             0x1
#define _LCDDATA21_S25C3_MASK                               0x2
#define _LCDDATA21_S26C3_POSN                               0x2
#define _LCDDATA21_S26C3_POSITION                           0x2
#define _LCDDATA21_S26C3_SIZE                               0x1
#define _LCDDATA21_S26C3_LENGTH                             0x1
#define _LCDDATA21_S26C3_MASK                               0x4
#define _LCDDATA21_S27C3_POSN                               0x3
#define _LCDDATA21_S27C3_POSITION                           0x3
#define _LCDDATA21_S27C3_SIZE                               0x1
#define _LCDDATA21_S27C3_LENGTH                             0x1
#define _LCDDATA21_S27C3_MASK                               0x8
#define _LCDDATA21_S28C3_POSN                               0x4
#define _LCDDATA21_S28C3_POSITION                           0x4
#define _LCDDATA21_S28C3_SIZE                               0x1
#define _LCDDATA21_S28C3_LENGTH                             0x1
#define _LCDDATA21_S28C3_MASK                               0x10
#define _LCDDATA21_S29C3_POSN                               0x5
#define _LCDDATA21_S29C3_POSITION                           0x5
#define _LCDDATA21_S29C3_SIZE                               0x1
#define _LCDDATA21_S29C3_LENGTH                             0x1
#define _LCDDATA21_S29C3_MASK                               0x20
#define _LCDDATA21_S30C3_POSN                               0x6
#define _LCDDATA21_S30C3_POSITION                           0x6
#define _LCDDATA21_S30C3_SIZE                               0x1
#define _LCDDATA21_S30C3_LENGTH                             0x1
#define _LCDDATA21_S30C3_MASK                               0x40
#define _LCDDATA21_S31C3_POSN                               0x7
#define _LCDDATA21_S31C3_POSITION                           0x7
#define _LCDDATA21_S31C3_SIZE                               0x1
#define _LCDDATA21_S31C3_LENGTH                             0x1
#define _LCDDATA21_S31C3_MASK                               0x80

// Register: LCDDATA22
#define LCDDATA22 LCDDATA22
extern volatile unsigned char           LCDDATA22           __at(0x1D2E);
#ifndef _LIB_BUILD
asm("LCDDATA22 equ 01D2Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S32C3                  :1;
        unsigned S33C3                  :1;
        unsigned S34C3                  :1;
    };
} LCDDATA22bits_t;
extern volatile LCDDATA22bits_t LCDDATA22bits __at(0x1D2E);
// bitfield macros
#define _LCDDATA22_S32C3_POSN                               0x0
#define _LCDDATA22_S32C3_POSITION                           0x0
#define _LCDDATA22_S32C3_SIZE                               0x1
#define _LCDDATA22_S32C3_LENGTH                             0x1
#define _LCDDATA22_S32C3_MASK                               0x1
#define _LCDDATA22_S33C3_POSN                               0x1
#define _LCDDATA22_S33C3_POSITION                           0x1
#define _LCDDATA22_S33C3_SIZE                               0x1
#define _LCDDATA22_S33C3_LENGTH                             0x1
#define _LCDDATA22_S33C3_MASK                               0x2
#define _LCDDATA22_S34C3_POSN                               0x2
#define _LCDDATA22_S34C3_POSITION                           0x2
#define _LCDDATA22_S34C3_SIZE                               0x1
#define _LCDDATA22_S34C3_LENGTH                             0x1
#define _LCDDATA22_S34C3_MASK                               0x4

// Register: LCDDATA23
#define LCDDATA23 LCDDATA23
extern volatile unsigned char           LCDDATA23           __at(0x1D2F);
#ifndef _LIB_BUILD
asm("LCDDATA23 equ 01D2Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S40C3                  :1;
        unsigned S41C3                  :1;
        unsigned S42C3                  :1;
        unsigned S43C3                  :1;
        unsigned S44C3                  :1;
        unsigned S45C3                  :1;
        unsigned S46C3                  :1;
        unsigned S47C3                  :1;
    };
} LCDDATA23bits_t;
extern volatile LCDDATA23bits_t LCDDATA23bits __at(0x1D2F);
// bitfield macros
#define _LCDDATA23_S40C3_POSN                               0x0
#define _LCDDATA23_S40C3_POSITION                           0x0
#define _LCDDATA23_S40C3_SIZE                               0x1
#define _LCDDATA23_S40C3_LENGTH                             0x1
#define _LCDDATA23_S40C3_MASK                               0x1
#define _LCDDATA23_S41C3_POSN                               0x1
#define _LCDDATA23_S41C3_POSITION                           0x1
#define _LCDDATA23_S41C3_SIZE                               0x1
#define _LCDDATA23_S41C3_LENGTH                             0x1
#define _LCDDATA23_S41C3_MASK                               0x2
#define _LCDDATA23_S42C3_POSN                               0x2
#define _LCDDATA23_S42C3_POSITION                           0x2
#define _LCDDATA23_S42C3_SIZE                               0x1
#define _LCDDATA23_S42C3_LENGTH                             0x1
#define _LCDDATA23_S42C3_MASK                               0x4
#define _LCDDATA23_S43C3_POSN                               0x3
#define _LCDDATA23_S43C3_POSITION                           0x3
#define _LCDDATA23_S43C3_SIZE                               0x1
#define _LCDDATA23_S43C3_LENGTH                             0x1
#define _LCDDATA23_S43C3_MASK                               0x8
#define _LCDDATA23_S44C3_POSN                               0x4
#define _LCDDATA23_S44C3_POSITION                           0x4
#define _LCDDATA23_S44C3_SIZE                               0x1
#define _LCDDATA23_S44C3_LENGTH                             0x1
#define _LCDDATA23_S44C3_MASK                               0x10
#define _LCDDATA23_S45C3_POSN                               0x5
#define _LCDDATA23_S45C3_POSITION                           0x5
#define _LCDDATA23_S45C3_SIZE                               0x1
#define _LCDDATA23_S45C3_LENGTH                             0x1
#define _LCDDATA23_S45C3_MASK                               0x20
#define _LCDDATA23_S46C3_POSN                               0x6
#define _LCDDATA23_S46C3_POSITION                           0x6
#define _LCDDATA23_S46C3_SIZE                               0x1
#define _LCDDATA23_S46C3_LENGTH                             0x1
#define _LCDDATA23_S46C3_MASK                               0x40
#define _LCDDATA23_S47C3_POSN                               0x7
#define _LCDDATA23_S47C3_POSITION                           0x7
#define _LCDDATA23_S47C3_SIZE                               0x1
#define _LCDDATA23_S47C3_LENGTH                             0x1
#define _LCDDATA23_S47C3_MASK                               0x80

// Register: LCDDATA24
#define LCDDATA24 LCDDATA24
extern volatile unsigned char           LCDDATA24           __at(0x1D30);
#ifndef _LIB_BUILD
asm("LCDDATA24 equ 01D30h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C4                  :1;
        unsigned S01C4                  :1;
        unsigned S02C4                  :1;
        unsigned S03C4                  :1;
        unsigned S04C4                  :1;
        unsigned                        :1;
        unsigned S06C4                  :1;
        unsigned S07C4                  :1;
    };
} LCDDATA24bits_t;
