MikroElektronika/core_packages/PIC/XC8/def/PIC16F19185/mcu.h
#define                                 MINH0_bit           _BIT_ACCESS(MINUTES,4)
// MINUTES<MINH1>
extern volatile __bit                   MINH1               __at(0x60AD);	// @ (0xC15 * 8 + 5)
#define                                 MINH1_bit           _BIT_ACCESS(MINUTES,5)
// MINUTES<MINH2>
extern volatile __bit                   MINH2               __at(0x60AE);	// @ (0xC15 * 8 + 6)
#define                                 MINH2_bit           _BIT_ACCESS(MINUTES,6)
// MINUTES<MINL0>
extern volatile __bit                   MINL0               __at(0x60A8);	// @ (0xC15 * 8 + 0)
#define                                 MINL0_bit           _BIT_ACCESS(MINUTES,0)
// MINUTES<MINL1>
extern volatile __bit                   MINL1               __at(0x60A9);	// @ (0xC15 * 8 + 1)
#define                                 MINL1_bit           _BIT_ACCESS(MINUTES,1)
// MINUTES<MINL2>
extern volatile __bit                   MINL2               __at(0x60AA);	// @ (0xC15 * 8 + 2)
#define                                 MINL2_bit           _BIT_ACCESS(MINUTES,2)
// MINUTES<MINL3>
extern volatile __bit                   MINL3               __at(0x60AB);	// @ (0xC15 * 8 + 3)
#define                                 MINL3_bit           _BIT_ACCESS(MINUTES,3)
// CLCDATA<MLC1OUT>
extern volatile __bit                   MLC1OUT             __at(0xF078);	// @ (0x1E0F * 8 + 0)
#define                                 MLC1OUT_bit         _BIT_ACCESS(CLCDATA,0)
// CLCDATA<MLC2OUT>
extern volatile __bit                   MLC2OUT             __at(0xF079);	// @ (0x1E0F * 8 + 1)
#define                                 MLC2OUT_bit         _BIT_ACCESS(CLCDATA,1)
// CLCDATA<MLC3OUT>
extern volatile __bit                   MLC3OUT             __at(0xF07A);	// @ (0x1E0F * 8 + 2)
#define                                 MLC3OUT_bit         _BIT_ACCESS(CLCDATA,2)
// CLCDATA<MLC4OUT>
extern volatile __bit                   MLC4OUT             __at(0xF07B);	// @ (0x1E0F * 8 + 3)
#define                                 MLC4OUT_bit         _BIT_ACCESS(CLCDATA,3)
// MONTH<MONTHH>
extern volatile __bit                   MONTHH              __at(0x608C);	// @ (0xC11 * 8 + 4)
#define                                 MONTHH_bit          _BIT_ACCESS(MONTH,4)
// MONTH<MONTHL0>
extern volatile __bit                   MONTHL0             __at(0x6088);	// @ (0xC11 * 8 + 0)
#define                                 MONTHL0_bit         _BIT_ACCESS(MONTH,0)
// MONTH<MONTHL1>
extern volatile __bit                   MONTHL1             __at(0x6089);	// @ (0xC11 * 8 + 1)
#define                                 MONTHL1_bit         _BIT_ACCESS(MONTH,1)
// MONTH<MONTHL2>
extern volatile __bit                   MONTHL2             __at(0x608A);	// @ (0xC11 * 8 + 2)
#define                                 MONTHL2_bit         _BIT_ACCESS(MONTH,2)
// MONTH<MONTHL3>
extern volatile __bit                   MONTHL3             __at(0x608B);	// @ (0xC11 * 8 + 3)
#define                                 MONTHL3_bit         _BIT_ACCESS(MONTH,3)
// SSP1ADD<MSK01>
extern volatile __bit                   MSK01               __at(0xC68);	// @ (0x18D * 8 + 0)
#define                                 MSK01_bit           _BIT_ACCESS(SSP1ADD,0)
// SSP1ADD<MSK11>
extern volatile __bit                   MSK11               __at(0xC69);	// @ (0x18D * 8 + 1)
#define                                 MSK11_bit           _BIT_ACCESS(SSP1ADD,1)
// SSP1ADD<MSK21>
extern volatile __bit                   MSK21               __at(0xC6A);	// @ (0x18D * 8 + 2)
#define                                 MSK21_bit           _BIT_ACCESS(SSP1ADD,2)
// SSP1ADD<MSK31>
extern volatile __bit                   MSK31               __at(0xC6B);	// @ (0x18D * 8 + 3)
#define                                 MSK31_bit           _BIT_ACCESS(SSP1ADD,3)
// SSP1ADD<MSK41>
extern volatile __bit                   MSK41               __at(0xC6C);	// @ (0x18D * 8 + 4)
#define                                 MSK41_bit           _BIT_ACCESS(SSP1ADD,4)
// SSP1ADD<MSK51>
extern volatile __bit                   MSK51               __at(0xC6D);	// @ (0x18D * 8 + 5)
#define                                 MSK51_bit           _BIT_ACCESS(SSP1ADD,5)
// SSP1ADD<MSK61>
extern volatile __bit                   MSK61               __at(0xC6E);	// @ (0x18D * 8 + 6)
#define                                 MSK61_bit           _BIT_ACCESS(SSP1ADD,6)
// SSP1ADD<MSK71>
extern volatile __bit                   MSK71               __at(0xC6F);	// @ (0x18D * 8 + 7)
#define                                 MSK71_bit           _BIT_ACCESS(SSP1ADD,7)
// PMD4<MSSP1MD>
extern volatile __bit                   MSSP1MD             __at(0x3CD4);	// @ (0x79A * 8 + 4)
#define                                 MSSP1MD_bit         _BIT_ACCESS(PMD4,4)
// OSCCON1<NDIV0>
extern volatile __bit                   NDIV0               __at(0x4468);	// @ (0x88D * 8 + 0)
#define                                 NDIV0_bit           _BIT_ACCESS(OSCCON1,0)
// OSCCON1<NDIV1>
extern volatile __bit                   NDIV1               __at(0x4469);	// @ (0x88D * 8 + 1)
#define                                 NDIV1_bit           _BIT_ACCESS(OSCCON1,1)
// OSCCON1<NDIV2>
extern volatile __bit                   NDIV2               __at(0x446A);	// @ (0x88D * 8 + 2)
#define                                 NDIV2_bit           _BIT_ACCESS(OSCCON1,2)
// OSCCON1<NDIV3>
extern volatile __bit                   NDIV3               __at(0x446B);	// @ (0x88D * 8 + 3)
#define                                 NDIV3_bit           _BIT_ACCESS(OSCCON1,3)
// OSCCON1<NOSC0>
extern volatile __bit                   NOSC0               __at(0x446C);	// @ (0x88D * 8 + 4)
#define                                 NOSC0_bit           _BIT_ACCESS(OSCCON1,4)
// OSCCON1<NOSC1>
extern volatile __bit                   NOSC1               __at(0x446D);	// @ (0x88D * 8 + 5)
#define                                 NOSC1_bit           _BIT_ACCESS(OSCCON1,5)
// OSCCON1<NOSC2>
extern volatile __bit                   NOSC2               __at(0x446E);	// @ (0x88D * 8 + 6)
#define                                 NOSC2_bit           _BIT_ACCESS(OSCCON1,6)
// OSCCON3<NOSCR>
extern volatile __bit                   NOSCR               __at(0x447B);	// @ (0x88F * 8 + 3)
#define                                 NOSCR_bit           _BIT_ACCESS(OSCCON3,3)
// DAC1CON0<NSS>
extern volatile __bit                   NSS                 __at(0x4870);	// @ (0x90E * 8 + 0)
#define                                 NSS_bit             _BIT_ACCESS(DAC1CON0,0)
// NVMADRL<NVMADR0>
extern volatile __bit                   NVMADR0             __at(0x40D0);	// @ (0x81A * 8 + 0)
#define                                 NVMADR0_bit         _BIT_ACCESS(NVMADRL,0)
// NVMADRL<NVMADR1>
extern volatile __bit                   NVMADR1             __at(0x40D1);	// @ (0x81A * 8 + 1)
#define                                 NVMADR1_bit         _BIT_ACCESS(NVMADRL,1)
// NVMADRH<NVMADR10>
extern volatile __bit                   NVMADR10            __at(0x40DA);	// @ (0x81B * 8 + 2)
#define                                 NVMADR10_bit        _BIT_ACCESS(NVMADRH,2)
// NVMADRH<NVMADR11>
extern volatile __bit                   NVMADR11            __at(0x40DB);	// @ (0x81B * 8 + 3)
#define                                 NVMADR11_bit        _BIT_ACCESS(NVMADRH,3)
// NVMADRH<NVMADR12>
extern volatile __bit                   NVMADR12            __at(0x40DC);	// @ (0x81B * 8 + 4)
#define                                 NVMADR12_bit        _BIT_ACCESS(NVMADRH,4)
// NVMADRH<NVMADR13>
extern volatile __bit                   NVMADR13            __at(0x40DD);	// @ (0x81B * 8 + 5)
#define                                 NVMADR13_bit        _BIT_ACCESS(NVMADRH,5)
// NVMADRH<NVMADR14>
extern volatile __bit                   NVMADR14            __at(0x40DE);	// @ (0x81B * 8 + 6)
#define                                 NVMADR14_bit        _BIT_ACCESS(NVMADRH,6)
// NVMADRL<NVMADR2>
extern volatile __bit                   NVMADR2             __at(0x40D2);	// @ (0x81A * 8 + 2)
#define                                 NVMADR2_bit         _BIT_ACCESS(NVMADRL,2)
// NVMADRL<NVMADR3>
extern volatile __bit                   NVMADR3             __at(0x40D3);	// @ (0x81A * 8 + 3)
#define                                 NVMADR3_bit         _BIT_ACCESS(NVMADRL,3)
// NVMADRL<NVMADR4>
extern volatile __bit                   NVMADR4             __at(0x40D4);	// @ (0x81A * 8 + 4)
#define                                 NVMADR4_bit         _BIT_ACCESS(NVMADRL,4)
// NVMADRL<NVMADR5>
extern volatile __bit                   NVMADR5             __at(0x40D5);	// @ (0x81A * 8 + 5)
#define                                 NVMADR5_bit         _BIT_ACCESS(NVMADRL,5)
// NVMADRL<NVMADR6>
extern volatile __bit                   NVMADR6             __at(0x40D6);	// @ (0x81A * 8 + 6)
#define                                 NVMADR6_bit         _BIT_ACCESS(NVMADRL,6)
// NVMADRL<NVMADR7>
extern volatile __bit                   NVMADR7             __at(0x40D7);	// @ (0x81A * 8 + 7)
#define                                 NVMADR7_bit         _BIT_ACCESS(NVMADRL,7)
// NVMADRH<NVMADR8>
extern volatile __bit                   NVMADR8             __at(0x40D8);	// @ (0x81B * 8 + 0)
#define                                 NVMADR8_bit         _BIT_ACCESS(NVMADRH,0)
// NVMADRH<NVMADR9>
extern volatile __bit                   NVMADR9             __at(0x40D9);	// @ (0x81B * 8 + 1)
#define                                 NVMADR9_bit         _BIT_ACCESS(NVMADRH,1)
// NVMDATL<NVMDAT0>
extern volatile __bit                   NVMDAT0             __at(0x40E0);	// @ (0x81C * 8 + 0)
#define                                 NVMDAT0_bit         _BIT_ACCESS(NVMDATL,0)
// NVMDATL<NVMDAT1>
extern volatile __bit                   NVMDAT1             __at(0x40E1);	// @ (0x81C * 8 + 1)
#define                                 NVMDAT1_bit         _BIT_ACCESS(NVMDATL,1)
// NVMDATH<NVMDAT10>
extern volatile __bit                   NVMDAT10            __at(0x40EA);	// @ (0x81D * 8 + 2)
#define                                 NVMDAT10_bit        _BIT_ACCESS(NVMDATH,2)
// NVMDATH<NVMDAT11>
extern volatile __bit                   NVMDAT11            __at(0x40EB);	// @ (0x81D * 8 + 3)
#define                                 NVMDAT11_bit        _BIT_ACCESS(NVMDATH,3)
// NVMDATH<NVMDAT12>
extern volatile __bit                   NVMDAT12            __at(0x40EC);	// @ (0x81D * 8 + 4)
#define                                 NVMDAT12_bit        _BIT_ACCESS(NVMDATH,4)
// NVMDATH<NVMDAT13>
extern volatile __bit                   NVMDAT13            __at(0x40ED);	// @ (0x81D * 8 + 5)
#define                                 NVMDAT13_bit        _BIT_ACCESS(NVMDATH,5)
// NVMDATL<NVMDAT2>
extern volatile __bit                   NVMDAT2             __at(0x40E2);	// @ (0x81C * 8 + 2)
#define                                 NVMDAT2_bit         _BIT_ACCESS(NVMDATL,2)
// NVMDATL<NVMDAT3>
extern volatile __bit                   NVMDAT3             __at(0x40E3);	// @ (0x81C * 8 + 3)
#define                                 NVMDAT3_bit         _BIT_ACCESS(NVMDATL,3)
// NVMDATL<NVMDAT4>
extern volatile __bit                   NVMDAT4             __at(0x40E4);	// @ (0x81C * 8 + 4)
#define                                 NVMDAT4_bit         _BIT_ACCESS(NVMDATL,4)
// NVMDATL<NVMDAT5>
extern volatile __bit                   NVMDAT5             __at(0x40E5);	// @ (0x81C * 8 + 5)
#define                                 NVMDAT5_bit         _BIT_ACCESS(NVMDATL,5)
// NVMDATL<NVMDAT6>
extern volatile __bit                   NVMDAT6             __at(0x40E6);	// @ (0x81C * 8 + 6)
#define                                 NVMDAT6_bit         _BIT_ACCESS(NVMDATL,6)
// NVMDATL<NVMDAT7>
extern volatile __bit                   NVMDAT7             __at(0x40E7);	// @ (0x81C * 8 + 7)
#define                                 NVMDAT7_bit         _BIT_ACCESS(NVMDATL,7)
// NVMDATH<NVMDAT8>
extern volatile __bit                   NVMDAT8             __at(0x40E8);	// @ (0x81D * 8 + 0)
#define                                 NVMDAT8_bit         _BIT_ACCESS(NVMDATH,0)
// NVMDATH<NVMDAT9>
extern volatile __bit                   NVMDAT9             __at(0x40E9);	// @ (0x81D * 8 + 1)
#define                                 NVMDAT9_bit         _BIT_ACCESS(NVMDATH,1)
// PIE7<NVMIE>
extern volatile __bit                   NVMIE               __at(0x38ED);	// @ (0x71D * 8 + 5)
#define                                 NVMIE_bit           _BIT_ACCESS(PIE7,5)
// PIR7<NVMIF>
extern volatile __bit                   NVMIF               __at(0x389D);	// @ (0x713 * 8 + 5)
#define                                 NVMIF_bit           _BIT_ACCESS(PIR7,5)
// PMD0<NVMMD>
extern volatile __bit                   NVMMD               __at(0x3CB2);	// @ (0x796 * 8 + 2)
#define                                 NVMMD_bit           _BIT_ACCESS(PMD0,2)
// NVMCON1<NVMREGS>
extern volatile __bit                   NVMREGS             __at(0x40F6);	// @ (0x81E * 8 + 6)
#define                                 NVMREGS_bit         _BIT_ACCESS(NVMCON1,6)
// ODCONA<ODCA0>
extern volatile __bit                   ODCA0               __at(0xF9D0);	// @ (0x1F3A * 8 + 0)
#define                                 ODCA0_bit           _BIT_ACCESS(ODCONA,0)
// ODCONA<ODCA1>
extern volatile __bit                   ODCA1               __at(0xF9D1);	// @ (0x1F3A * 8 + 1)
#define                                 ODCA1_bit           _BIT_ACCESS(ODCONA,1)
// ODCONA<ODCA2>
extern volatile __bit                   ODCA2               __at(0xF9D2);	// @ (0x1F3A * 8 + 2)
#define                                 ODCA2_bit           _BIT_ACCESS(ODCONA,2)
// ODCONA<ODCA3>
extern volatile __bit                   ODCA3               __at(0xF9D3);	// @ (0x1F3A * 8 + 3)
#define                                 ODCA3_bit           _BIT_ACCESS(ODCONA,3)
// ODCONA<ODCA4>
extern volatile __bit                   ODCA4               __at(0xF9D4);	// @ (0x1F3A * 8 + 4)
#define                                 ODCA4_bit           _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCA6>
extern volatile __bit                   ODCA6               __at(0xF9D6);	// @ (0x1F3A * 8 + 6)
#define                                 ODCA6_bit           _BIT_ACCESS(ODCONA,6)
// ODCONA<ODCA7>
extern volatile __bit                   ODCA7               __at(0xF9D7);	// @ (0x1F3A * 8 + 7)
#define                                 ODCA7_bit           _BIT_ACCESS(ODCONA,7)
// ODCONB<ODCB0>
extern volatile __bit                   ODCB0               __at(0xFA28);	// @ (0x1F45 * 8 + 0)
#define                                 ODCB0_bit           _BIT_ACCESS(ODCONB,0)
// ODCONB<ODCB1>
extern volatile __bit                   ODCB1               __at(0xFA29);	// @ (0x1F45 * 8 + 1)
#define                                 ODCB1_bit           _BIT_ACCESS(ODCONB,1)
// ODCONB<ODCB2>
extern volatile __bit                   ODCB2               __at(0xFA2A);	// @ (0x1F45 * 8 + 2)
#define                                 ODCB2_bit           _BIT_ACCESS(ODCONB,2)
// ODCONB<ODCB3>
extern volatile __bit                   ODCB3               __at(0xFA2B);	// @ (0x1F45 * 8 + 3)
#define                                 ODCB3_bit           _BIT_ACCESS(ODCONB,3)
// ODCONB<ODCB4>
extern volatile __bit                   ODCB4               __at(0xFA2C);	// @ (0x1F45 * 8 + 4)
#define                                 ODCB4_bit           _BIT_ACCESS(ODCONB,4)
// ODCONB<ODCB5>
extern volatile __bit                   ODCB5               __at(0xFA2D);	// @ (0x1F45 * 8 + 5)
#define                                 ODCB5_bit           _BIT_ACCESS(ODCONB,5)
// ODCONB<ODCB6>
extern volatile __bit                   ODCB6               __at(0xFA2E);	// @ (0x1F45 * 8 + 6)
#define                                 ODCB6_bit           _BIT_ACCESS(ODCONB,6)
// ODCONB<ODCB7>
extern volatile __bit                   ODCB7               __at(0xFA2F);	// @ (0x1F45 * 8 + 7)
#define                                 ODCB7_bit           _BIT_ACCESS(ODCONB,7)
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0xFA80);	// @ (0x1F50 * 8 + 0)
#define                                 ODCC0_bit           _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0xFA81);	// @ (0x1F50 * 8 + 1)
#define                                 ODCC1_bit           _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCC2>
extern volatile __bit                   ODCC2               __at(0xFA82);	// @ (0x1F50 * 8 + 2)
#define                                 ODCC2_bit           _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0xFA83);	// @ (0x1F50 * 8 + 3)
#define                                 ODCC3_bit           _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0xFA84);	// @ (0x1F50 * 8 + 4)
#define                                 ODCC4_bit           _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCC6>
extern volatile __bit                   ODCC6               __at(0xFA86);	// @ (0x1F50 * 8 + 6)
#define                                 ODCC6_bit           _BIT_ACCESS(ODCONC,6)
// ODCONC<ODCC7>
extern volatile __bit                   ODCC7               __at(0xFA87);	// @ (0x1F50 * 8 + 7)
#define                                 ODCC7_bit           _BIT_ACCESS(ODCONC,7)
// ODCOND<ODCD0>
extern volatile __bit                   ODCD0               __at(0xFAD8);	// @ (0x1F5B * 8 + 0)
#define                                 ODCD0_bit           _BIT_ACCESS(ODCOND,0)
// ODCOND<ODCD1>
extern volatile __bit                   ODCD1               __at(0xFAD9);	// @ (0x1F5B * 8 + 1)
#define                                 ODCD1_bit           _BIT_ACCESS(ODCOND,1)
// ODCOND<ODCD2>
extern volatile __bit                   ODCD2               __at(0xFADA);	// @ (0x1F5B * 8 + 2)
#define                                 ODCD2_bit           _BIT_ACCESS(ODCOND,2)
// ODCOND<ODCD3>
extern volatile __bit                   ODCD3               __at(0xFADB);	// @ (0x1F5B * 8 + 3)
#define                                 ODCD3_bit           _BIT_ACCESS(ODCOND,3)
// ODCOND<ODCD4>
extern volatile __bit                   ODCD4               __at(0xFADC);	// @ (0x1F5B * 8 + 4)
#define                                 ODCD4_bit           _BIT_ACCESS(ODCOND,4)
// ODCOND<ODCD5>
extern volatile __bit                   ODCD5               __at(0xFADD);	// @ (0x1F5B * 8 + 5)
#define                                 ODCD5_bit           _BIT_ACCESS(ODCOND,5)
// ODCOND<ODCD6>
extern volatile __bit                   ODCD6               __at(0xFADE);	// @ (0x1F5B * 8 + 6)
#define                                 ODCD6_bit           _BIT_ACCESS(ODCOND,6)
// ODCOND<ODCD7>
extern volatile __bit                   ODCD7               __at(0xFADF);	// @ (0x1F5B * 8 + 7)
#define                                 ODCD7_bit           _BIT_ACCESS(ODCOND,7)
// ODCONE<ODCE0>
extern volatile __bit                   ODCE0               __at(0xFB30);	// @ (0x1F66 * 8 + 0)
#define                                 ODCE0_bit           _BIT_ACCESS(ODCONE,0)
// ODCONE<ODCE1>
extern volatile __bit                   ODCE1               __at(0xFB31);	// @ (0x1F66 * 8 + 1)
#define                                 ODCE1_bit           _BIT_ACCESS(ODCONE,1)
// ODCONF<ODCF0>
extern volatile __bit                   ODCF0               __at(0xF290);	// @ (0x1E52 * 8 + 0)
#define                                 ODCF0_bit           _BIT_ACCESS(ODCONF,0)
// ODCONF<ODCF1>
extern volatile __bit                   ODCF1               __at(0xF291);	// @ (0x1E52 * 8 + 1)
#define                                 ODCF1_bit           _BIT_ACCESS(ODCONF,1)
// ODCONF<ODCF2>
extern volatile __bit                   ODCF2               __at(0xF292);	// @ (0x1E52 * 8 + 2)
#define                                 ODCF2_bit           _BIT_ACCESS(ODCONF,2)
// ODCONF<ODCF3>
extern volatile __bit                   ODCF3               __at(0xF293);	// @ (0x1E52 * 8 + 3)
#define                                 ODCF3_bit           _BIT_ACCESS(ODCONF,3)
// ODCONF<ODCF4>
extern volatile __bit                   ODCF4               __at(0xF294);	// @ (0x1E52 * 8 + 4)
#define                                 ODCF4_bit           _BIT_ACCESS(ODCONF,4)
// ODCONF<ODCF5>
extern volatile __bit                   ODCF5               __at(0xF295);	// @ (0x1E52 * 8 + 5)
#define                                 ODCF5_bit           _BIT_ACCESS(ODCONF,5)
// ODCONF<ODCF6>
extern volatile __bit                   ODCF6               __at(0xF296);	// @ (0x1E52 * 8 + 6)
#define                                 ODCF6_bit           _BIT_ACCESS(ODCONF,6)
// ODCONF<ODCF7>
extern volatile __bit                   ODCF7               __at(0xF297);	// @ (0x1E52 * 8 + 7)
#define                                 ODCF7_bit           _BIT_ACCESS(ODCONF,7)
// DAC1CON0<OE1>
extern volatile __bit                   OE1                 __at(0x4875);	// @ (0x90E * 8 + 5)
#define                                 OE1_bit             _BIT_ACCESS(DAC1CON0,5)
// DAC1CON0<OE2>
extern volatile __bit                   OE2                 __at(0x4874);	// @ (0x90E * 8 + 4)
#define                                 OE2_bit             _BIT_ACCESS(DAC1CON0,4)
// OSCCON3<ORDY>
extern volatile __bit                   ORDY                __at(0x447C);	// @ (0x88F * 8 + 4)
#define                                 ORDY_bit            _BIT_ACCESS(OSCCON3,4)
// PIE1<OSFIE>
extern volatile __bit                   OSFIE               __at(0x38BF);	// @ (0x717 * 8 + 7)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<OSFIF>
extern volatile __bit                   OSFIF               __at(0x386F);	// @ (0x70D * 8 + 7)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR1,7)
// ADSTAT<OV>
extern volatile __bit                   OV                  __at(0x8AF);	// @ (0x115 * 8 + 7)
#define                                 OV_bit              _BIT_ACCESS(ADSTAT,7)
// CWG1STR<OVRA>
extern volatile __bit                   OVRA                __at(0x30A4);	// @ (0x614 * 8 + 4)
#define                                 OVRA_bit            _BIT_ACCESS(CWG1STR,4)
// CWG1STR<OVRB>
extern volatile __bit                   OVRB                __at(0x30A5);	// @ (0x614 * 8 + 5)
#define                                 OVRB_bit            _BIT_ACCESS(CWG1STR,5)
// CWG1STR<OVRC>
extern volatile __bit                   OVRC                __at(0x30A6);	// @ (0x614 * 8 + 6)
#define                                 OVRC_bit            _BIT_ACCESS(CWG1STR,6)
// CWG1STR<OVRD>
extern volatile __bit                   OVRD                __at(0x30A7);	// @ (0x614 * 8 + 7)
#define                                 OVRD_bit            _BIT_ACCESS(CWG1STR,7)
// SSP1STAT<P2>
extern volatile __bit                   P2                  __at(0xC7C);	// @ (0x18F * 8 + 4)
#define                                 P2_bit              _BIT_ACCESS(SSP1STAT,4)
// SSP1CON3<PCIE>
extern volatile __bit                   PCIE                __at(0xC96);	// @ (0x192 * 8 + 6)
#define                                 PCIE_bit            _BIT_ACCESS(SSP1CON3,6)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN>
extern volatile __bit                   PEN                 __at(0xC8A);	// @ (0x191 * 8 + 2)
#define                                 PEN_bit             _BIT_ACCESS(SSP1CON2,2)
// SSP1CON2<PEN1>
extern volatile __bit                   PEN1                __at(0xC8A);	// @ (0x191 * 8 + 2)
#define                                 PEN1_bit            _BIT_ACCESS(SSP1CON2,2)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x4480);	// @ (0x890 * 8 + 0)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,0)
// CWG1CON1<POLA>
