MikroElektronika/core_packages/PIC/XC8/def/PIC16F19185/mcu.h
extern volatile __bit                   S10C7               __at(0xEA1A);	// @ (0x1D43 * 8 + 2)
#define                                 S10C7_bit           _BIT_ACCESS(LCDDATA43,2)
// LCDDATA1<S11C0>
extern volatile __bit                   S11C0               __at(0xE8CB);	// @ (0x1D19 * 8 + 3)
#define                                 S11C0_bit           _BIT_ACCESS(LCDDATA1,3)
// LCDDATA7<S11C1>
extern volatile __bit                   S11C1               __at(0xE8FB);	// @ (0x1D1F * 8 + 3)
#define                                 S11C1_bit           _BIT_ACCESS(LCDDATA7,3)
// LCDDATA13<S11C2>
extern volatile __bit                   S11C2               __at(0xE92B);	// @ (0x1D25 * 8 + 3)
#define                                 S11C2_bit           _BIT_ACCESS(LCDDATA13,3)
// LCDDATA19<S11C3>
extern volatile __bit                   S11C3               __at(0xE95B);	// @ (0x1D2B * 8 + 3)
#define                                 S11C3_bit           _BIT_ACCESS(LCDDATA19,3)
// LCDDATA25<S11C4>
extern volatile __bit                   S11C4               __at(0xE98B);	// @ (0x1D31 * 8 + 3)
#define                                 S11C4_bit           _BIT_ACCESS(LCDDATA25,3)
// LCDDATA31<S11C5>
extern volatile __bit                   S11C5               __at(0xE9BB);	// @ (0x1D37 * 8 + 3)
#define                                 S11C5_bit           _BIT_ACCESS(LCDDATA31,3)
// LCDDATA37<S11C6>
extern volatile __bit                   S11C6               __at(0xE9EB);	// @ (0x1D3D * 8 + 3)
#define                                 S11C6_bit           _BIT_ACCESS(LCDDATA37,3)
// LCDDATA43<S11C7>
extern volatile __bit                   S11C7               __at(0xEA1B);	// @ (0x1D43 * 8 + 3)
#define                                 S11C7_bit           _BIT_ACCESS(LCDDATA43,3)
// LCDDATA1<S13C0>
extern volatile __bit                   S13C0               __at(0xE8CD);	// @ (0x1D19 * 8 + 5)
#define                                 S13C0_bit           _BIT_ACCESS(LCDDATA1,5)
// LCDDATA7<S13C1>
extern volatile __bit                   S13C1               __at(0xE8FD);	// @ (0x1D1F * 8 + 5)
#define                                 S13C1_bit           _BIT_ACCESS(LCDDATA7,5)
// LCDDATA13<S13C2>
extern volatile __bit                   S13C2               __at(0xE92D);	// @ (0x1D25 * 8 + 5)
#define                                 S13C2_bit           _BIT_ACCESS(LCDDATA13,5)
// LCDDATA19<S13C3>
extern volatile __bit                   S13C3               __at(0xE95D);	// @ (0x1D2B * 8 + 5)
#define                                 S13C3_bit           _BIT_ACCESS(LCDDATA19,5)
// LCDDATA25<S13C4>
extern volatile __bit                   S13C4               __at(0xE98D);	// @ (0x1D31 * 8 + 5)
#define                                 S13C4_bit           _BIT_ACCESS(LCDDATA25,5)
// LCDDATA31<S13C5>
extern volatile __bit                   S13C5               __at(0xE9BD);	// @ (0x1D37 * 8 + 5)
#define                                 S13C5_bit           _BIT_ACCESS(LCDDATA31,5)
// LCDDATA37<S13C6>
extern volatile __bit                   S13C6               __at(0xE9ED);	// @ (0x1D3D * 8 + 5)
#define                                 S13C6_bit           _BIT_ACCESS(LCDDATA37,5)
// LCDDATA43<S13C7>
extern volatile __bit                   S13C7               __at(0xEA1D);	// @ (0x1D43 * 8 + 5)
#define                                 S13C7_bit           _BIT_ACCESS(LCDDATA43,5)
// LCDDATA1<S14C0>
extern volatile __bit                   S14C0               __at(0xE8CE);	// @ (0x1D19 * 8 + 6)
#define                                 S14C0_bit           _BIT_ACCESS(LCDDATA1,6)
// LCDDATA7<S14C1>
extern volatile __bit                   S14C1               __at(0xE8FE);	// @ (0x1D1F * 8 + 6)
#define                                 S14C1_bit           _BIT_ACCESS(LCDDATA7,6)
// LCDDATA13<S14C2>
extern volatile __bit                   S14C2               __at(0xE92E);	// @ (0x1D25 * 8 + 6)
#define                                 S14C2_bit           _BIT_ACCESS(LCDDATA13,6)
// LCDDATA19<S14C3>
extern volatile __bit                   S14C3               __at(0xE95E);	// @ (0x1D2B * 8 + 6)
#define                                 S14C3_bit           _BIT_ACCESS(LCDDATA19,6)
// LCDDATA25<S14C4>
extern volatile __bit                   S14C4               __at(0xE98E);	// @ (0x1D31 * 8 + 6)
#define                                 S14C4_bit           _BIT_ACCESS(LCDDATA25,6)
// LCDDATA31<S14C5>
extern volatile __bit                   S14C5               __at(0xE9BE);	// @ (0x1D37 * 8 + 6)
#define                                 S14C5_bit           _BIT_ACCESS(LCDDATA31,6)
// LCDDATA37<S14C6>
extern volatile __bit                   S14C6               __at(0xE9EE);	// @ (0x1D3D * 8 + 6)
#define                                 S14C6_bit           _BIT_ACCESS(LCDDATA37,6)
// LCDDATA43<S14C7>
extern volatile __bit                   S14C7               __at(0xEA1E);	// @ (0x1D43 * 8 + 6)
#define                                 S14C7_bit           _BIT_ACCESS(LCDDATA43,6)
// LCDDATA1<S15C0>
extern volatile __bit                   S15C0               __at(0xE8CF);	// @ (0x1D19 * 8 + 7)
#define                                 S15C0_bit           _BIT_ACCESS(LCDDATA1,7)
// LCDDATA7<S15C1>
extern volatile __bit                   S15C1               __at(0xE8FF);	// @ (0x1D1F * 8 + 7)
#define                                 S15C1_bit           _BIT_ACCESS(LCDDATA7,7)
// LCDDATA13<S15C2>
extern volatile __bit                   S15C2               __at(0xE92F);	// @ (0x1D25 * 8 + 7)
#define                                 S15C2_bit           _BIT_ACCESS(LCDDATA13,7)
// LCDDATA19<S15C3>
extern volatile __bit                   S15C3               __at(0xE95F);	// @ (0x1D2B * 8 + 7)
#define                                 S15C3_bit           _BIT_ACCESS(LCDDATA19,7)
// LCDDATA25<S15C4>
extern volatile __bit                   S15C4               __at(0xE98F);	// @ (0x1D31 * 8 + 7)
#define                                 S15C4_bit           _BIT_ACCESS(LCDDATA25,7)
// LCDDATA31<S15C5>
extern volatile __bit                   S15C5               __at(0xE9BF);	// @ (0x1D37 * 8 + 7)
#define                                 S15C5_bit           _BIT_ACCESS(LCDDATA31,7)
// LCDDATA37<S15C6>
extern volatile __bit                   S15C6               __at(0xE9EF);	// @ (0x1D3D * 8 + 7)
#define                                 S15C6_bit           _BIT_ACCESS(LCDDATA37,7)
// LCDDATA43<S15C7>
extern volatile __bit                   S15C7               __at(0xEA1F);	// @ (0x1D43 * 8 + 7)
#define                                 S15C7_bit           _BIT_ACCESS(LCDDATA43,7)
// LCDDATA2<S18C0>
extern volatile __bit                   S18C0               __at(0xE8D2);	// @ (0x1D1A * 8 + 2)
#define                                 S18C0_bit           _BIT_ACCESS(LCDDATA2,2)
// LCDDATA8<S18C1>
extern volatile __bit                   S18C1               __at(0xE902);	// @ (0x1D20 * 8 + 2)
#define                                 S18C1_bit           _BIT_ACCESS(LCDDATA8,2)
// LCDDATA14<S18C2>
extern volatile __bit                   S18C2               __at(0xE932);	// @ (0x1D26 * 8 + 2)
#define                                 S18C2_bit           _BIT_ACCESS(LCDDATA14,2)
// LCDDATA20<S18C3>
extern volatile __bit                   S18C3               __at(0xE962);	// @ (0x1D2C * 8 + 2)
#define                                 S18C3_bit           _BIT_ACCESS(LCDDATA20,2)
// LCDDATA26<S18C4>
extern volatile __bit                   S18C4               __at(0xE992);	// @ (0x1D32 * 8 + 2)
#define                                 S18C4_bit           _BIT_ACCESS(LCDDATA26,2)
// LCDDATA32<S18C5>
extern volatile __bit                   S18C5               __at(0xE9C2);	// @ (0x1D38 * 8 + 2)
#define                                 S18C5_bit           _BIT_ACCESS(LCDDATA32,2)
// LCDDATA38<S18C6>
extern volatile __bit                   S18C6               __at(0xE9F2);	// @ (0x1D3E * 8 + 2)
#define                                 S18C6_bit           _BIT_ACCESS(LCDDATA38,2)
// LCDDATA44<S18C7>
extern volatile __bit                   S18C7               __at(0xEA22);	// @ (0x1D44 * 8 + 2)
#define                                 S18C7_bit           _BIT_ACCESS(LCDDATA44,2)
// LCDDATA2<S19C0>
extern volatile __bit                   S19C0               __at(0xE8D3);	// @ (0x1D1A * 8 + 3)
#define                                 S19C0_bit           _BIT_ACCESS(LCDDATA2,3)
// LCDDATA8<S19C1>
extern volatile __bit                   S19C1               __at(0xE903);	// @ (0x1D20 * 8 + 3)
#define                                 S19C1_bit           _BIT_ACCESS(LCDDATA8,3)
// LCDDATA14<S19C2>
extern volatile __bit                   S19C2               __at(0xE933);	// @ (0x1D26 * 8 + 3)
#define                                 S19C2_bit           _BIT_ACCESS(LCDDATA14,3)
// LCDDATA20<S19C3>
extern volatile __bit                   S19C3               __at(0xE963);	// @ (0x1D2C * 8 + 3)
#define                                 S19C3_bit           _BIT_ACCESS(LCDDATA20,3)
// LCDDATA26<S19C4>
extern volatile __bit                   S19C4               __at(0xE993);	// @ (0x1D32 * 8 + 3)
#define                                 S19C4_bit           _BIT_ACCESS(LCDDATA26,3)
// LCDDATA32<S19C5>
extern volatile __bit                   S19C5               __at(0xE9C3);	// @ (0x1D38 * 8 + 3)
#define                                 S19C5_bit           _BIT_ACCESS(LCDDATA32,3)
// LCDDATA38<S19C6>
extern volatile __bit                   S19C6               __at(0xE9F3);	// @ (0x1D3E * 8 + 3)
#define                                 S19C6_bit           _BIT_ACCESS(LCDDATA38,3)
// LCDDATA44<S19C7>
extern volatile __bit                   S19C7               __at(0xEA23);	// @ (0x1D44 * 8 + 3)
#define                                 S19C7_bit           _BIT_ACCESS(LCDDATA44,3)
// SSP1STAT<S2>
extern volatile __bit                   S2                  __at(0xC7B);	// @ (0x18F * 8 + 3)
#define                                 S2_bit              _BIT_ACCESS(SSP1STAT,3)
// LCDDATA2<S20C0>
extern volatile __bit                   S20C0               __at(0xE8D4);	// @ (0x1D1A * 8 + 4)
#define                                 S20C0_bit           _BIT_ACCESS(LCDDATA2,4)
// LCDDATA8<S20C1>
extern volatile __bit                   S20C1               __at(0xE904);	// @ (0x1D20 * 8 + 4)
#define                                 S20C1_bit           _BIT_ACCESS(LCDDATA8,4)
// LCDDATA14<S20C2>
extern volatile __bit                   S20C2               __at(0xE934);	// @ (0x1D26 * 8 + 4)
#define                                 S20C2_bit           _BIT_ACCESS(LCDDATA14,4)
// LCDDATA20<S20C3>
extern volatile __bit                   S20C3               __at(0xE964);	// @ (0x1D2C * 8 + 4)
#define                                 S20C3_bit           _BIT_ACCESS(LCDDATA20,4)
// LCDDATA26<S20C4>
extern volatile __bit                   S20C4               __at(0xE994);	// @ (0x1D32 * 8 + 4)
#define                                 S20C4_bit           _BIT_ACCESS(LCDDATA26,4)
// LCDDATA32<S20C5>
extern volatile __bit                   S20C5               __at(0xE9C4);	// @ (0x1D38 * 8 + 4)
#define                                 S20C5_bit           _BIT_ACCESS(LCDDATA32,4)
// LCDDATA38<S20C6>
extern volatile __bit                   S20C6               __at(0xE9F4);	// @ (0x1D3E * 8 + 4)
#define                                 S20C6_bit           _BIT_ACCESS(LCDDATA38,4)
// LCDDATA44<S20C7>
extern volatile __bit                   S20C7               __at(0xEA24);	// @ (0x1D44 * 8 + 4)
#define                                 S20C7_bit           _BIT_ACCESS(LCDDATA44,4)
// LCDDATA2<S22C0>
extern volatile __bit                   S22C0               __at(0xE8D6);	// @ (0x1D1A * 8 + 6)
#define                                 S22C0_bit           _BIT_ACCESS(LCDDATA2,6)
// LCDDATA8<S22C1>
extern volatile __bit                   S22C1               __at(0xE906);	// @ (0x1D20 * 8 + 6)
#define                                 S22C1_bit           _BIT_ACCESS(LCDDATA8,6)
// LCDDATA14<S22C2>
extern volatile __bit                   S22C2               __at(0xE936);	// @ (0x1D26 * 8 + 6)
#define                                 S22C2_bit           _BIT_ACCESS(LCDDATA14,6)
// LCDDATA20<S22C3>
extern volatile __bit                   S22C3               __at(0xE966);	// @ (0x1D2C * 8 + 6)
#define                                 S22C3_bit           _BIT_ACCESS(LCDDATA20,6)
// LCDDATA26<S22C4>
extern volatile __bit                   S22C4               __at(0xE996);	// @ (0x1D32 * 8 + 6)
#define                                 S22C4_bit           _BIT_ACCESS(LCDDATA26,6)
// LCDDATA32<S22C5>
extern volatile __bit                   S22C5               __at(0xE9C6);	// @ (0x1D38 * 8 + 6)
#define                                 S22C5_bit           _BIT_ACCESS(LCDDATA32,6)
// LCDDATA38<S22C6>
extern volatile __bit                   S22C6               __at(0xE9F6);	// @ (0x1D3E * 8 + 6)
#define                                 S22C6_bit           _BIT_ACCESS(LCDDATA38,6)
// LCDDATA44<S22C7>
extern volatile __bit                   S22C7               __at(0xEA26);	// @ (0x1D44 * 8 + 6)
#define                                 S22C7_bit           _BIT_ACCESS(LCDDATA44,6)
// LCDDATA2<S23C0>
extern volatile __bit                   S23C0               __at(0xE8D7);	// @ (0x1D1A * 8 + 7)
#define                                 S23C0_bit           _BIT_ACCESS(LCDDATA2,7)
// LCDDATA8<S23C1>
extern volatile __bit                   S23C1               __at(0xE907);	// @ (0x1D20 * 8 + 7)
#define                                 S23C1_bit           _BIT_ACCESS(LCDDATA8,7)
// LCDDATA14<S23C2>
extern volatile __bit                   S23C2               __at(0xE937);	// @ (0x1D26 * 8 + 7)
#define                                 S23C2_bit           _BIT_ACCESS(LCDDATA14,7)
// LCDDATA20<S23C3>
extern volatile __bit                   S23C3               __at(0xE967);	// @ (0x1D2C * 8 + 7)
#define                                 S23C3_bit           _BIT_ACCESS(LCDDATA20,7)
// LCDDATA26<S23C4>
extern volatile __bit                   S23C4               __at(0xE997);	// @ (0x1D32 * 8 + 7)
#define                                 S23C4_bit           _BIT_ACCESS(LCDDATA26,7)
// LCDDATA32<S23C5>
extern volatile __bit                   S23C5               __at(0xE9C7);	// @ (0x1D38 * 8 + 7)
#define                                 S23C5_bit           _BIT_ACCESS(LCDDATA32,7)
// LCDDATA38<S23C6>
extern volatile __bit                   S23C6               __at(0xE9F7);	// @ (0x1D3E * 8 + 7)
#define                                 S23C6_bit           _BIT_ACCESS(LCDDATA38,7)
// LCDDATA44<S23C7>
extern volatile __bit                   S23C7               __at(0xEA27);	// @ (0x1D44 * 8 + 7)
#define                                 S23C7_bit           _BIT_ACCESS(LCDDATA44,7)
// LCDDATA3<S24C0>
extern volatile __bit                   S24C0               __at(0xE8D8);	// @ (0x1D1B * 8 + 0)
#define                                 S24C0_bit           _BIT_ACCESS(LCDDATA3,0)
// LCDDATA9<S24C1>
extern volatile __bit                   S24C1               __at(0xE908);	// @ (0x1D21 * 8 + 0)
#define                                 S24C1_bit           _BIT_ACCESS(LCDDATA9,0)
// LCDDATA15<S24C2>
extern volatile __bit                   S24C2               __at(0xE938);	// @ (0x1D27 * 8 + 0)
#define                                 S24C2_bit           _BIT_ACCESS(LCDDATA15,0)
// LCDDATA21<S24C3>
extern volatile __bit                   S24C3               __at(0xE968);	// @ (0x1D2D * 8 + 0)
#define                                 S24C3_bit           _BIT_ACCESS(LCDDATA21,0)
// LCDDATA27<S24C4>
extern volatile __bit                   S24C4               __at(0xE998);	// @ (0x1D33 * 8 + 0)
#define                                 S24C4_bit           _BIT_ACCESS(LCDDATA27,0)
// LCDDATA33<S24C5>
extern volatile __bit                   S24C5               __at(0xE9C8);	// @ (0x1D39 * 8 + 0)
#define                                 S24C5_bit           _BIT_ACCESS(LCDDATA33,0)
// LCDDATA39<S24C6>
extern volatile __bit                   S24C6               __at(0xE9F8);	// @ (0x1D3F * 8 + 0)
#define                                 S24C6_bit           _BIT_ACCESS(LCDDATA39,0)
// LCDDATA45<S24C7>
extern volatile __bit                   S24C7               __at(0xEA28);	// @ (0x1D45 * 8 + 0)
#define                                 S24C7_bit           _BIT_ACCESS(LCDDATA45,0)
// LCDDATA3<S25C0>
extern volatile __bit                   S25C0               __at(0xE8D9);	// @ (0x1D1B * 8 + 1)
#define                                 S25C0_bit           _BIT_ACCESS(LCDDATA3,1)
// LCDDATA9<S25C1>
extern volatile __bit                   S25C1               __at(0xE909);	// @ (0x1D21 * 8 + 1)
#define                                 S25C1_bit           _BIT_ACCESS(LCDDATA9,1)
// LCDDATA15<S25C2>
extern volatile __bit                   S25C2               __at(0xE939);	// @ (0x1D27 * 8 + 1)
#define                                 S25C2_bit           _BIT_ACCESS(LCDDATA15,1)
// LCDDATA21<S25C3>
extern volatile __bit                   S25C3               __at(0xE969);	// @ (0x1D2D * 8 + 1)
#define                                 S25C3_bit           _BIT_ACCESS(LCDDATA21,1)
// LCDDATA27<S25C4>
extern volatile __bit                   S25C4               __at(0xE999);	// @ (0x1D33 * 8 + 1)
#define                                 S25C4_bit           _BIT_ACCESS(LCDDATA27,1)
// LCDDATA33<S25C5>
extern volatile __bit                   S25C5               __at(0xE9C9);	// @ (0x1D39 * 8 + 1)
#define                                 S25C5_bit           _BIT_ACCESS(LCDDATA33,1)
// LCDDATA39<S25C6>
extern volatile __bit                   S25C6               __at(0xE9F9);	// @ (0x1D3F * 8 + 1)
#define                                 S25C6_bit           _BIT_ACCESS(LCDDATA39,1)
// LCDDATA45<S25C7>
extern volatile __bit                   S25C7               __at(0xEA29);	// @ (0x1D45 * 8 + 1)
#define                                 S25C7_bit           _BIT_ACCESS(LCDDATA45,1)
// LCDDATA3<S26C0>
extern volatile __bit                   S26C0               __at(0xE8DA);	// @ (0x1D1B * 8 + 2)
#define                                 S26C0_bit           _BIT_ACCESS(LCDDATA3,2)
// LCDDATA9<S26C1>
extern volatile __bit                   S26C1               __at(0xE90A);	// @ (0x1D21 * 8 + 2)
#define                                 S26C1_bit           _BIT_ACCESS(LCDDATA9,2)
// LCDDATA15<S26C2>
extern volatile __bit                   S26C2               __at(0xE93A);	// @ (0x1D27 * 8 + 2)
#define                                 S26C2_bit           _BIT_ACCESS(LCDDATA15,2)
// LCDDATA21<S26C3>
extern volatile __bit                   S26C3               __at(0xE96A);	// @ (0x1D2D * 8 + 2)
#define                                 S26C3_bit           _BIT_ACCESS(LCDDATA21,2)
// LCDDATA27<S26C4>
extern volatile __bit                   S26C4               __at(0xE99A);	// @ (0x1D33 * 8 + 2)
#define                                 S26C4_bit           _BIT_ACCESS(LCDDATA27,2)
// LCDDATA33<S26C5>
extern volatile __bit                   S26C5               __at(0xE9CA);	// @ (0x1D39 * 8 + 2)
#define                                 S26C5_bit           _BIT_ACCESS(LCDDATA33,2)
// LCDDATA39<S26C6>
extern volatile __bit                   S26C6               __at(0xE9FA);	// @ (0x1D3F * 8 + 2)
#define                                 S26C6_bit           _BIT_ACCESS(LCDDATA39,2)
// LCDDATA45<S26C7>
extern volatile __bit                   S26C7               __at(0xEA2A);	// @ (0x1D45 * 8 + 2)
#define                                 S26C7_bit           _BIT_ACCESS(LCDDATA45,2)
// LCDDATA3<S27C0>
extern volatile __bit                   S27C0               __at(0xE8DB);	// @ (0x1D1B * 8 + 3)
#define                                 S27C0_bit           _BIT_ACCESS(LCDDATA3,3)
// LCDDATA9<S27C1>
extern volatile __bit                   S27C1               __at(0xE90B);	// @ (0x1D21 * 8 + 3)
#define                                 S27C1_bit           _BIT_ACCESS(LCDDATA9,3)
// LCDDATA15<S27C2>
extern volatile __bit                   S27C2               __at(0xE93B);	// @ (0x1D27 * 8 + 3)
#define                                 S27C2_bit           _BIT_ACCESS(LCDDATA15,3)
// LCDDATA21<S27C3>
extern volatile __bit                   S27C3               __at(0xE96B);	// @ (0x1D2D * 8 + 3)
#define                                 S27C3_bit           _BIT_ACCESS(LCDDATA21,3)
// LCDDATA27<S27C4>
extern volatile __bit                   S27C4               __at(0xE99B);	// @ (0x1D33 * 8 + 3)
#define                                 S27C4_bit           _BIT_ACCESS(LCDDATA27,3)
// LCDDATA33<S27C5>
extern volatile __bit                   S27C5               __at(0xE9CB);	// @ (0x1D39 * 8 + 3)
#define                                 S27C5_bit           _BIT_ACCESS(LCDDATA33,3)
// LCDDATA39<S27C6>
extern volatile __bit                   S27C6               __at(0xE9FB);	// @ (0x1D3F * 8 + 3)
#define                                 S27C6_bit           _BIT_ACCESS(LCDDATA39,3)
// LCDDATA45<S27C7>
extern volatile __bit                   S27C7               __at(0xEA2B);	// @ (0x1D45 * 8 + 3)
#define                                 S27C7_bit           _BIT_ACCESS(LCDDATA45,3)
// LCDDATA3<S28C0>
extern volatile __bit                   S28C0               __at(0xE8DC);	// @ (0x1D1B * 8 + 4)
#define                                 S28C0_bit           _BIT_ACCESS(LCDDATA3,4)
// LCDDATA9<S28C1>
extern volatile __bit                   S28C1               __at(0xE90C);	// @ (0x1D21 * 8 + 4)
#define                                 S28C1_bit           _BIT_ACCESS(LCDDATA9,4)
// LCDDATA15<S28C2>
extern volatile __bit                   S28C2               __at(0xE93C);	// @ (0x1D27 * 8 + 4)
#define                                 S28C2_bit           _BIT_ACCESS(LCDDATA15,4)
// LCDDATA21<S28C3>
extern volatile __bit                   S28C3               __at(0xE96C);	// @ (0x1D2D * 8 + 4)
#define                                 S28C3_bit           _BIT_ACCESS(LCDDATA21,4)
// LCDDATA27<S28C4>
extern volatile __bit                   S28C4               __at(0xE99C);	// @ (0x1D33 * 8 + 4)
#define                                 S28C4_bit           _BIT_ACCESS(LCDDATA27,4)
// LCDDATA33<S28C5>
extern volatile __bit                   S28C5               __at(0xE9CC);	// @ (0x1D39 * 8 + 4)
#define                                 S28C5_bit           _BIT_ACCESS(LCDDATA33,4)
// LCDDATA39<S28C6>
extern volatile __bit                   S28C6               __at(0xE9FC);	// @ (0x1D3F * 8 + 4)
#define                                 S28C6_bit           _BIT_ACCESS(LCDDATA39,4)
// LCDDATA45<S28C7>
extern volatile __bit                   S28C7               __at(0xEA2C);	// @ (0x1D45 * 8 + 4)
#define                                 S28C7_bit           _BIT_ACCESS(LCDDATA45,4)
// LCDDATA3<S29C0>
extern volatile __bit                   S29C0               __at(0xE8DD);	// @ (0x1D1B * 8 + 5)
#define                                 S29C0_bit           _BIT_ACCESS(LCDDATA3,5)
// LCDDATA9<S29C1>
extern volatile __bit                   S29C1               __at(0xE90D);	// @ (0x1D21 * 8 + 5)
#define                                 S29C1_bit           _BIT_ACCESS(LCDDATA9,5)
// LCDDATA15<S29C2>
extern volatile __bit                   S29C2               __at(0xE93D);	// @ (0x1D27 * 8 + 5)
#define                                 S29C2_bit           _BIT_ACCESS(LCDDATA15,5)
// LCDDATA21<S29C3>
extern volatile __bit                   S29C3               __at(0xE96D);	// @ (0x1D2D * 8 + 5)
#define                                 S29C3_bit           _BIT_ACCESS(LCDDATA21,5)
// LCDDATA27<S29C4>
extern volatile __bit                   S29C4               __at(0xE99D);	// @ (0x1D33 * 8 + 5)
#define                                 S29C4_bit           _BIT_ACCESS(LCDDATA27,5)
// LCDDATA33<S29C5>
extern volatile __bit                   S29C5               __at(0xE9CD);	// @ (0x1D39 * 8 + 5)
