MikroElektronika/core_packages/PIC/XC8/def/PIC16F19185/mcu.h
#define                                 S29C5_bit           _BIT_ACCESS(LCDDATA33,5)
// LCDDATA39<S29C6>
extern volatile __bit                   S29C6               __at(0xE9FD);	// @ (0x1D3F * 8 + 5)
#define                                 S29C6_bit           _BIT_ACCESS(LCDDATA39,5)
// LCDDATA45<S29C7>
extern volatile __bit                   S29C7               __at(0xEA2D);	// @ (0x1D45 * 8 + 5)
#define                                 S29C7_bit           _BIT_ACCESS(LCDDATA45,5)
// LCDDATA3<S30C0>
extern volatile __bit                   S30C0               __at(0xE8DE);	// @ (0x1D1B * 8 + 6)
#define                                 S30C0_bit           _BIT_ACCESS(LCDDATA3,6)
// LCDDATA9<S30C1>
extern volatile __bit                   S30C1               __at(0xE90E);	// @ (0x1D21 * 8 + 6)
#define                                 S30C1_bit           _BIT_ACCESS(LCDDATA9,6)
// LCDDATA15<S30C2>
extern volatile __bit                   S30C2               __at(0xE93E);	// @ (0x1D27 * 8 + 6)
#define                                 S30C2_bit           _BIT_ACCESS(LCDDATA15,6)
// LCDDATA21<S30C3>
extern volatile __bit                   S30C3               __at(0xE96E);	// @ (0x1D2D * 8 + 6)
#define                                 S30C3_bit           _BIT_ACCESS(LCDDATA21,6)
// LCDDATA27<S30C4>
extern volatile __bit                   S30C4               __at(0xE99E);	// @ (0x1D33 * 8 + 6)
#define                                 S30C4_bit           _BIT_ACCESS(LCDDATA27,6)
// LCDDATA33<S30C5>
extern volatile __bit                   S30C5               __at(0xE9CE);	// @ (0x1D39 * 8 + 6)
#define                                 S30C5_bit           _BIT_ACCESS(LCDDATA33,6)
// LCDDATA39<S30C6>
extern volatile __bit                   S30C6               __at(0xE9FE);	// @ (0x1D3F * 8 + 6)
#define                                 S30C6_bit           _BIT_ACCESS(LCDDATA39,6)
// LCDDATA45<S30C7>
extern volatile __bit                   S30C7               __at(0xEA2E);	// @ (0x1D45 * 8 + 6)
#define                                 S30C7_bit           _BIT_ACCESS(LCDDATA45,6)
// LCDDATA3<S31C0>
extern volatile __bit                   S31C0               __at(0xE8DF);	// @ (0x1D1B * 8 + 7)
#define                                 S31C0_bit           _BIT_ACCESS(LCDDATA3,7)
// LCDDATA9<S31C1>
extern volatile __bit                   S31C1               __at(0xE90F);	// @ (0x1D21 * 8 + 7)
#define                                 S31C1_bit           _BIT_ACCESS(LCDDATA9,7)
// LCDDATA15<S31C2>
extern volatile __bit                   S31C2               __at(0xE93F);	// @ (0x1D27 * 8 + 7)
#define                                 S31C2_bit           _BIT_ACCESS(LCDDATA15,7)
// LCDDATA21<S31C3>
extern volatile __bit                   S31C3               __at(0xE96F);	// @ (0x1D2D * 8 + 7)
#define                                 S31C3_bit           _BIT_ACCESS(LCDDATA21,7)
// LCDDATA27<S31C4>
extern volatile __bit                   S31C4               __at(0xE99F);	// @ (0x1D33 * 8 + 7)
#define                                 S31C4_bit           _BIT_ACCESS(LCDDATA27,7)
// LCDDATA33<S31C5>
extern volatile __bit                   S31C5               __at(0xE9CF);	// @ (0x1D39 * 8 + 7)
#define                                 S31C5_bit           _BIT_ACCESS(LCDDATA33,7)
// LCDDATA39<S31C6>
extern volatile __bit                   S31C6               __at(0xE9FF);	// @ (0x1D3F * 8 + 7)
#define                                 S31C6_bit           _BIT_ACCESS(LCDDATA39,7)
// LCDDATA45<S31C7>
extern volatile __bit                   S31C7               __at(0xEA2F);	// @ (0x1D45 * 8 + 7)
#define                                 S31C7_bit           _BIT_ACCESS(LCDDATA45,7)
// LCDDATA4<S32C0>
extern volatile __bit                   S32C0               __at(0xE8E0);	// @ (0x1D1C * 8 + 0)
#define                                 S32C0_bit           _BIT_ACCESS(LCDDATA4,0)
// LCDDATA10<S32C1>
extern volatile __bit                   S32C1               __at(0xE910);	// @ (0x1D22 * 8 + 0)
#define                                 S32C1_bit           _BIT_ACCESS(LCDDATA10,0)
// LCDDATA16<S32C2>
extern volatile __bit                   S32C2               __at(0xE940);	// @ (0x1D28 * 8 + 0)
#define                                 S32C2_bit           _BIT_ACCESS(LCDDATA16,0)
// LCDDATA22<S32C3>
extern volatile __bit                   S32C3               __at(0xE970);	// @ (0x1D2E * 8 + 0)
#define                                 S32C3_bit           _BIT_ACCESS(LCDDATA22,0)
// LCDDATA28<S32C4>
extern volatile __bit                   S32C4               __at(0xE9A0);	// @ (0x1D34 * 8 + 0)
#define                                 S32C4_bit           _BIT_ACCESS(LCDDATA28,0)
// LCDDATA34<S32C5>
extern volatile __bit                   S32C5               __at(0xE9D0);	// @ (0x1D3A * 8 + 0)
#define                                 S32C5_bit           _BIT_ACCESS(LCDDATA34,0)
// LCDDATA40<S32C6>
extern volatile __bit                   S32C6               __at(0xEA00);	// @ (0x1D40 * 8 + 0)
#define                                 S32C6_bit           _BIT_ACCESS(LCDDATA40,0)
// LCDDATA46<S32C7>
extern volatile __bit                   S32C7               __at(0xEA30);	// @ (0x1D46 * 8 + 0)
#define                                 S32C7_bit           _BIT_ACCESS(LCDDATA46,0)
// LCDDATA4<S33C0>
extern volatile __bit                   S33C0               __at(0xE8E1);	// @ (0x1D1C * 8 + 1)
#define                                 S33C0_bit           _BIT_ACCESS(LCDDATA4,1)
// LCDDATA10<S33C1>
extern volatile __bit                   S33C1               __at(0xE911);	// @ (0x1D22 * 8 + 1)
#define                                 S33C1_bit           _BIT_ACCESS(LCDDATA10,1)
// LCDDATA16<S33C2>
extern volatile __bit                   S33C2               __at(0xE941);	// @ (0x1D28 * 8 + 1)
#define                                 S33C2_bit           _BIT_ACCESS(LCDDATA16,1)
// LCDDATA22<S33C3>
extern volatile __bit                   S33C3               __at(0xE971);	// @ (0x1D2E * 8 + 1)
#define                                 S33C3_bit           _BIT_ACCESS(LCDDATA22,1)
// LCDDATA28<S33C4>
extern volatile __bit                   S33C4               __at(0xE9A1);	// @ (0x1D34 * 8 + 1)
#define                                 S33C4_bit           _BIT_ACCESS(LCDDATA28,1)
// LCDDATA34<S33C5>
extern volatile __bit                   S33C5               __at(0xE9D1);	// @ (0x1D3A * 8 + 1)
#define                                 S33C5_bit           _BIT_ACCESS(LCDDATA34,1)
// LCDDATA40<S33C6>
extern volatile __bit                   S33C6               __at(0xEA01);	// @ (0x1D40 * 8 + 1)
#define                                 S33C6_bit           _BIT_ACCESS(LCDDATA40,1)
// LCDDATA46<S33C7>
extern volatile __bit                   S33C7               __at(0xEA31);	// @ (0x1D46 * 8 + 1)
#define                                 S33C7_bit           _BIT_ACCESS(LCDDATA46,1)
// LCDDATA4<S34C0>
extern volatile __bit                   S34C0               __at(0xE8E2);	// @ (0x1D1C * 8 + 2)
#define                                 S34C0_bit           _BIT_ACCESS(LCDDATA4,2)
// LCDDATA10<S34C1>
extern volatile __bit                   S34C1               __at(0xE912);	// @ (0x1D22 * 8 + 2)
#define                                 S34C1_bit           _BIT_ACCESS(LCDDATA10,2)
// LCDDATA16<S34C2>
extern volatile __bit                   S34C2               __at(0xE942);	// @ (0x1D28 * 8 + 2)
#define                                 S34C2_bit           _BIT_ACCESS(LCDDATA16,2)
// LCDDATA22<S34C3>
extern volatile __bit                   S34C3               __at(0xE972);	// @ (0x1D2E * 8 + 2)
#define                                 S34C3_bit           _BIT_ACCESS(LCDDATA22,2)
// LCDDATA28<S34C4>
extern volatile __bit                   S34C4               __at(0xE9A2);	// @ (0x1D34 * 8 + 2)
#define                                 S34C4_bit           _BIT_ACCESS(LCDDATA28,2)
// LCDDATA34<S34C5>
extern volatile __bit                   S34C5               __at(0xE9D2);	// @ (0x1D3A * 8 + 2)
#define                                 S34C5_bit           _BIT_ACCESS(LCDDATA34,2)
// LCDDATA40<S34C6>
extern volatile __bit                   S34C6               __at(0xEA02);	// @ (0x1D40 * 8 + 2)
#define                                 S34C6_bit           _BIT_ACCESS(LCDDATA40,2)
// LCDDATA46<S34C7>
extern volatile __bit                   S34C7               __at(0xEA32);	// @ (0x1D46 * 8 + 2)
#define                                 S34C7_bit           _BIT_ACCESS(LCDDATA46,2)
// LCDDATA5<S40C0>
extern volatile __bit                   S40C0               __at(0xE8E8);	// @ (0x1D1D * 8 + 0)
#define                                 S40C0_bit           _BIT_ACCESS(LCDDATA5,0)
// LCDDATA11<S40C1>
extern volatile __bit                   S40C1               __at(0xE918);	// @ (0x1D23 * 8 + 0)
#define                                 S40C1_bit           _BIT_ACCESS(LCDDATA11,0)
// LCDDATA17<S40C2>
extern volatile __bit                   S40C2               __at(0xE948);	// @ (0x1D29 * 8 + 0)
#define                                 S40C2_bit           _BIT_ACCESS(LCDDATA17,0)
// LCDDATA23<S40C3>
extern volatile __bit                   S40C3               __at(0xE978);	// @ (0x1D2F * 8 + 0)
#define                                 S40C3_bit           _BIT_ACCESS(LCDDATA23,0)
// LCDDATA29<S40C4>
extern volatile __bit                   S40C4               __at(0xE9A8);	// @ (0x1D35 * 8 + 0)
#define                                 S40C4_bit           _BIT_ACCESS(LCDDATA29,0)
// LCDDATA35<S40C5>
extern volatile __bit                   S40C5               __at(0xE9D8);	// @ (0x1D3B * 8 + 0)
#define                                 S40C5_bit           _BIT_ACCESS(LCDDATA35,0)
// LCDDATA41<S40C6>
extern volatile __bit                   S40C6               __at(0xEA08);	// @ (0x1D41 * 8 + 0)
#define                                 S40C6_bit           _BIT_ACCESS(LCDDATA41,0)
// LCDDATA47<S40C7>
extern volatile __bit                   S40C7               __at(0xEA38);	// @ (0x1D47 * 8 + 0)
#define                                 S40C7_bit           _BIT_ACCESS(LCDDATA47,0)
// LCDDATA5<S41C0>
extern volatile __bit                   S41C0               __at(0xE8E9);	// @ (0x1D1D * 8 + 1)
#define                                 S41C0_bit           _BIT_ACCESS(LCDDATA5,1)
// LCDDATA11<S41C1>
extern volatile __bit                   S41C1               __at(0xE919);	// @ (0x1D23 * 8 + 1)
#define                                 S41C1_bit           _BIT_ACCESS(LCDDATA11,1)
// LCDDATA17<S41C2>
extern volatile __bit                   S41C2               __at(0xE949);	// @ (0x1D29 * 8 + 1)
#define                                 S41C2_bit           _BIT_ACCESS(LCDDATA17,1)
// LCDDATA23<S41C3>
extern volatile __bit                   S41C3               __at(0xE979);	// @ (0x1D2F * 8 + 1)
#define                                 S41C3_bit           _BIT_ACCESS(LCDDATA23,1)
// LCDDATA29<S41C4>
extern volatile __bit                   S41C4               __at(0xE9A9);	// @ (0x1D35 * 8 + 1)
#define                                 S41C4_bit           _BIT_ACCESS(LCDDATA29,1)
// LCDDATA35<S41C5>
extern volatile __bit                   S41C5               __at(0xE9D9);	// @ (0x1D3B * 8 + 1)
#define                                 S41C5_bit           _BIT_ACCESS(LCDDATA35,1)
// LCDDATA41<S41C6>
extern volatile __bit                   S41C6               __at(0xEA09);	// @ (0x1D41 * 8 + 1)
#define                                 S41C6_bit           _BIT_ACCESS(LCDDATA41,1)
// LCDDATA47<S41C7>
extern volatile __bit                   S41C7               __at(0xEA39);	// @ (0x1D47 * 8 + 1)
#define                                 S41C7_bit           _BIT_ACCESS(LCDDATA47,1)
// LCDDATA5<S42C0>
extern volatile __bit                   S42C0               __at(0xE8EA);	// @ (0x1D1D * 8 + 2)
#define                                 S42C0_bit           _BIT_ACCESS(LCDDATA5,2)
// LCDDATA11<S42C1>
extern volatile __bit                   S42C1               __at(0xE91A);	// @ (0x1D23 * 8 + 2)
#define                                 S42C1_bit           _BIT_ACCESS(LCDDATA11,2)
// LCDDATA17<S42C2>
extern volatile __bit                   S42C2               __at(0xE94A);	// @ (0x1D29 * 8 + 2)
#define                                 S42C2_bit           _BIT_ACCESS(LCDDATA17,2)
// LCDDATA23<S42C3>
extern volatile __bit                   S42C3               __at(0xE97A);	// @ (0x1D2F * 8 + 2)
#define                                 S42C3_bit           _BIT_ACCESS(LCDDATA23,2)
// LCDDATA29<S42C4>
extern volatile __bit                   S42C4               __at(0xE9AA);	// @ (0x1D35 * 8 + 2)
#define                                 S42C4_bit           _BIT_ACCESS(LCDDATA29,2)
// LCDDATA35<S42C5>
extern volatile __bit                   S42C5               __at(0xE9DA);	// @ (0x1D3B * 8 + 2)
#define                                 S42C5_bit           _BIT_ACCESS(LCDDATA35,2)
// LCDDATA41<S42C6>
extern volatile __bit                   S42C6               __at(0xEA0A);	// @ (0x1D41 * 8 + 2)
#define                                 S42C6_bit           _BIT_ACCESS(LCDDATA41,2)
// LCDDATA47<S42C7>
extern volatile __bit                   S42C7               __at(0xEA3A);	// @ (0x1D47 * 8 + 2)
#define                                 S42C7_bit           _BIT_ACCESS(LCDDATA47,2)
// LCDDATA5<S43C0>
extern volatile __bit                   S43C0               __at(0xE8EB);	// @ (0x1D1D * 8 + 3)
#define                                 S43C0_bit           _BIT_ACCESS(LCDDATA5,3)
// LCDDATA11<S43C1>
extern volatile __bit                   S43C1               __at(0xE91B);	// @ (0x1D23 * 8 + 3)
#define                                 S43C1_bit           _BIT_ACCESS(LCDDATA11,3)
// LCDDATA17<S43C2>
extern volatile __bit                   S43C2               __at(0xE94B);	// @ (0x1D29 * 8 + 3)
#define                                 S43C2_bit           _BIT_ACCESS(LCDDATA17,3)
// LCDDATA23<S43C3>
extern volatile __bit                   S43C3               __at(0xE97B);	// @ (0x1D2F * 8 + 3)
#define                                 S43C3_bit           _BIT_ACCESS(LCDDATA23,3)
// LCDDATA29<S43C4>
extern volatile __bit                   S43C4               __at(0xE9AB);	// @ (0x1D35 * 8 + 3)
#define                                 S43C4_bit           _BIT_ACCESS(LCDDATA29,3)
// LCDDATA35<S43C5>
extern volatile __bit                   S43C5               __at(0xE9DB);	// @ (0x1D3B * 8 + 3)
#define                                 S43C5_bit           _BIT_ACCESS(LCDDATA35,3)
// LCDDATA41<S43C6>
extern volatile __bit                   S43C6               __at(0xEA0B);	// @ (0x1D41 * 8 + 3)
#define                                 S43C6_bit           _BIT_ACCESS(LCDDATA41,3)
// LCDDATA47<S43C7>
extern volatile __bit                   S43C7               __at(0xEA3B);	// @ (0x1D47 * 8 + 3)
#define                                 S43C7_bit           _BIT_ACCESS(LCDDATA47,3)
// LCDDATA5<S44C0>
extern volatile __bit                   S44C0               __at(0xE8EC);	// @ (0x1D1D * 8 + 4)
#define                                 S44C0_bit           _BIT_ACCESS(LCDDATA5,4)
// LCDDATA11<S44C1>
extern volatile __bit                   S44C1               __at(0xE91C);	// @ (0x1D23 * 8 + 4)
#define                                 S44C1_bit           _BIT_ACCESS(LCDDATA11,4)
// LCDDATA17<S44C2>
extern volatile __bit                   S44C2               __at(0xE94C);	// @ (0x1D29 * 8 + 4)
#define                                 S44C2_bit           _BIT_ACCESS(LCDDATA17,4)
// LCDDATA23<S44C3>
extern volatile __bit                   S44C3               __at(0xE97C);	// @ (0x1D2F * 8 + 4)
#define                                 S44C3_bit           _BIT_ACCESS(LCDDATA23,4)
// LCDDATA29<S44C4>
extern volatile __bit                   S44C4               __at(0xE9AC);	// @ (0x1D35 * 8 + 4)
#define                                 S44C4_bit           _BIT_ACCESS(LCDDATA29,4)
// LCDDATA35<S44C5>
extern volatile __bit                   S44C5               __at(0xE9DC);	// @ (0x1D3B * 8 + 4)
#define                                 S44C5_bit           _BIT_ACCESS(LCDDATA35,4)
// LCDDATA41<S44C6>
extern volatile __bit                   S44C6               __at(0xEA0C);	// @ (0x1D41 * 8 + 4)
#define                                 S44C6_bit           _BIT_ACCESS(LCDDATA41,4)
// LCDDATA47<S44C7>
extern volatile __bit                   S44C7               __at(0xEA3C);	// @ (0x1D47 * 8 + 4)
#define                                 S44C7_bit           _BIT_ACCESS(LCDDATA47,4)
// LCDDATA5<S45C0>
extern volatile __bit                   S45C0               __at(0xE8ED);	// @ (0x1D1D * 8 + 5)
#define                                 S45C0_bit           _BIT_ACCESS(LCDDATA5,5)
// LCDDATA11<S45C1>
extern volatile __bit                   S45C1               __at(0xE91D);	// @ (0x1D23 * 8 + 5)
#define                                 S45C1_bit           _BIT_ACCESS(LCDDATA11,5)
// LCDDATA17<S45C2>
extern volatile __bit                   S45C2               __at(0xE94D);	// @ (0x1D29 * 8 + 5)
#define                                 S45C2_bit           _BIT_ACCESS(LCDDATA17,5)
// LCDDATA23<S45C3>
extern volatile __bit                   S45C3               __at(0xE97D);	// @ (0x1D2F * 8 + 5)
#define                                 S45C3_bit           _BIT_ACCESS(LCDDATA23,5)
// LCDDATA29<S45C4>
extern volatile __bit                   S45C4               __at(0xE9AD);	// @ (0x1D35 * 8 + 5)
#define                                 S45C4_bit           _BIT_ACCESS(LCDDATA29,5)
// LCDDATA35<S45C5>
extern volatile __bit                   S45C5               __at(0xE9DD);	// @ (0x1D3B * 8 + 5)
#define                                 S45C5_bit           _BIT_ACCESS(LCDDATA35,5)
// LCDDATA41<S45C6>
extern volatile __bit                   S45C6               __at(0xEA0D);	// @ (0x1D41 * 8 + 5)
#define                                 S45C6_bit           _BIT_ACCESS(LCDDATA41,5)
// LCDDATA47<S45C7>
extern volatile __bit                   S45C7               __at(0xEA3D);	// @ (0x1D47 * 8 + 5)
#define                                 S45C7_bit           _BIT_ACCESS(LCDDATA47,5)
// LCDDATA5<S46C0>
extern volatile __bit                   S46C0               __at(0xE8EE);	// @ (0x1D1D * 8 + 6)
#define                                 S46C0_bit           _BIT_ACCESS(LCDDATA5,6)
// LCDDATA11<S46C1>
extern volatile __bit                   S46C1               __at(0xE91E);	// @ (0x1D23 * 8 + 6)
#define                                 S46C1_bit           _BIT_ACCESS(LCDDATA11,6)
// LCDDATA17<S46C2>
extern volatile __bit                   S46C2               __at(0xE94E);	// @ (0x1D29 * 8 + 6)
#define                                 S46C2_bit           _BIT_ACCESS(LCDDATA17,6)
// LCDDATA23<S46C3>
extern volatile __bit                   S46C3               __at(0xE97E);	// @ (0x1D2F * 8 + 6)
#define                                 S46C3_bit           _BIT_ACCESS(LCDDATA23,6)
// LCDDATA29<S46C4>
extern volatile __bit                   S46C4               __at(0xE9AE);	// @ (0x1D35 * 8 + 6)
#define                                 S46C4_bit           _BIT_ACCESS(LCDDATA29,6)
// LCDDATA35<S46C5>
extern volatile __bit                   S46C5               __at(0xE9DE);	// @ (0x1D3B * 8 + 6)
#define                                 S46C5_bit           _BIT_ACCESS(LCDDATA35,6)
// LCDDATA41<S46C6>
extern volatile __bit                   S46C6               __at(0xEA0E);	// @ (0x1D41 * 8 + 6)
#define                                 S46C6_bit           _BIT_ACCESS(LCDDATA41,6)
// LCDDATA47<S46C7>
extern volatile __bit                   S46C7               __at(0xEA3E);	// @ (0x1D47 * 8 + 6)
#define                                 S46C7_bit           _BIT_ACCESS(LCDDATA47,6)
// LCDDATA5<S47C0>
extern volatile __bit                   S47C0               __at(0xE8EF);	// @ (0x1D1D * 8 + 7)
#define                                 S47C0_bit           _BIT_ACCESS(LCDDATA5,7)
// LCDDATA11<S47C1>
extern volatile __bit                   S47C1               __at(0xE91F);	// @ (0x1D23 * 8 + 7)
#define                                 S47C1_bit           _BIT_ACCESS(LCDDATA11,7)
// LCDDATA17<S47C2>
extern volatile __bit                   S47C2               __at(0xE94F);	// @ (0x1D29 * 8 + 7)
#define                                 S47C2_bit           _BIT_ACCESS(LCDDATA17,7)
// LCDDATA23<S47C3>
extern volatile __bit                   S47C3               __at(0xE97F);	// @ (0x1D2F * 8 + 7)
#define                                 S47C3_bit           _BIT_ACCESS(LCDDATA23,7)
// LCDDATA29<S47C4>
extern volatile __bit                   S47C4               __at(0xE9AF);	// @ (0x1D35 * 8 + 7)
#define                                 S47C4_bit           _BIT_ACCESS(LCDDATA29,7)
// LCDDATA35<S47C5>
extern volatile __bit                   S47C5               __at(0xE9DF);	// @ (0x1D3B * 8 + 7)
#define                                 S47C5_bit           _BIT_ACCESS(LCDDATA35,7)
// LCDDATA41<S47C6>
extern volatile __bit                   S47C6               __at(0xEA0F);	// @ (0x1D41 * 8 + 7)
#define                                 S47C6_bit           _BIT_ACCESS(LCDDATA41,7)
// LCDDATA47<S47C7>
extern volatile __bit                   S47C7               __at(0xEA3F);	// @ (0x1D47 * 8 + 7)
#define                                 S47C7_bit           _BIT_ACCESS(LCDDATA47,7)
// SSP1CON3<SBCDE>
extern volatile __bit                   SBCDE               __at(0xC92);	// @ (0x192 * 8 + 2)
#define                                 SBCDE_bit           _BIT_ACCESS(SSP1CON3,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x408F);	// @ (0x811 * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// SSP1CON3<SCIE>
extern volatile __bit                   SCIE                __at(0xC95);	// @ (0x192 * 8 + 5)
#define                                 SCIE_bit            _BIT_ACCESS(SSP1CON3,5)
// SSP1CON3<SDAHT>
extern volatile __bit                   SDAHT               __at(0xC93);	// @ (0x192 * 8 + 3)
#define                                 SDAHT_bit           _BIT_ACCESS(SSP1CON3,3)
// LCDSE0<SE00>
extern volatile __bit                   SE00                __at(0xE870);	// @ (0x1D0E * 8 + 0)
#define                                 SE00_bit            _BIT_ACCESS(LCDSE0,0)
// LCDSE0<SE01>
extern volatile __bit                   SE01                __at(0xE871);	// @ (0x1D0E * 8 + 1)
#define                                 SE01_bit            _BIT_ACCESS(LCDSE0,1)
// LCDSE0<SE02>
extern volatile __bit                   SE02                __at(0xE872);	// @ (0x1D0E * 8 + 2)
#define                                 SE02_bit            _BIT_ACCESS(LCDSE0,2)
// LCDSE0<SE03>
extern volatile __bit                   SE03                __at(0xE873);	// @ (0x1D0E * 8 + 3)
#define                                 SE03_bit            _BIT_ACCESS(LCDSE0,3)
// LCDSE0<SE04>
extern volatile __bit                   SE04                __at(0xE874);	// @ (0x1D0E * 8 + 4)
#define                                 SE04_bit            _BIT_ACCESS(LCDSE0,4)
// LCDSE0<SE05>
extern volatile __bit                   SE05                __at(0xE875);	// @ (0x1D0E * 8 + 5)
#define                                 SE05_bit            _BIT_ACCESS(LCDSE0,5)
// LCDSE0<SE06>
extern volatile __bit                   SE06                __at(0xE876);	// @ (0x1D0E * 8 + 6)
#define                                 SE06_bit            _BIT_ACCESS(LCDSE0,6)
// LCDSE0<SE07>
extern volatile __bit                   SE07                __at(0xE877);	// @ (0x1D0E * 8 + 7)
#define                                 SE07_bit            _BIT_ACCESS(LCDSE0,7)
// LCDSE1<SE08>
extern volatile __bit                   SE08                __at(0xE878);	// @ (0x1D0F * 8 + 0)
#define                                 SE08_bit            _BIT_ACCESS(LCDSE1,0)
// LCDSE1<SE09>
